package chapter15;

public class Ex11_PartiallyFilled {

    public static void main(String[] args) {

        // 가변 배열 선언과 동시에 초기화!
        // 행마다 열의 개수가 다름 (★ 중요한 포인트!)
        int[][] arr = {
            {11},               // 0번째 행: 1개 값
            {22, 33},           // 1번째 행: 2개 값
            {44, 55, 66}        // 2번째 행: 3개 값
        };

        // 바깥 for문 : 행을 돌면서
        for(int i = 0; i < arr.length; i++) {   
            // 안쪽 for문 : 현재 행의 열 개수만큼 돌면서
            for(int j = 0; j < arr[i].length; j++) { 
                // 현재 위치의 값을 출력 (탭으로 띄우기)
                System.out.print(arr[i][j] + "\t");
            }
            // 한 행 출력이 끝나면 줄 바꿈
            System.out.println();
        }
        
//      3차원 배열
     // 3x3x3 크기의 3차원 배열 생성
        int[][][] arr3 = new int[3][3][3];

        // 0층 값 대입
        arr3[0][0][0] = 1;
        arr3[0][0][1] = 2;
        arr3[0][0][2] = 3;
        arr3[0][1][0] = 4;
        arr3[0][1][1] = 5;
        arr3[0][1][2] = 6;
        arr3[0][2][0] = 7;
        arr3[0][2][1] = 8;
        arr3[0][2][2] = 9;

        // 1층 값 대입
        arr3[1][0][0] = 10;
        arr3[1][0][1] = 11;
        arr3[1][0][2] = 12;
        arr3[1][1][0] = 13;
        arr3[1][1][1] = 14;
        arr3[1][1][2] = 15;
        arr3[1][2][0] = 16;
        arr3[1][2][1] = 17;
        arr3[1][2][2] = 18;

        // 2층 값 대입
        arr3[2][0][0] = 19;
        arr3[2][0][1] = 20;
        arr3[2][0][2] = 21;
        arr3[2][1][0] = 22;
        arr3[2][1][1] = 23;
        arr3[2][1][2] = 24;
        arr3[2][2][0] = 25;
        arr3[2][2][1] = 26;
        arr3[2][2][2] = 27;

        // 값 출력
        for(int i = 0; i < 3; i++) {
            System.out.println("층: " + i);
            for(int j = 0; j < 3; j++) {
                for(int k = 0; k < 3; k++) {
                    System.out.print(arr3[i][j][k] + " ");
                }
                System.out.println(); // 행 끝
            }
            System.out.println(); // 층 끝
        }
        
//        다른 대입 방법
//        int[][][] arr4 = {
//        	    { {1,2,3}, {4,5,6}, {7,8,9} },
//        	    { {10,11,12}, {13,14,15}, {16,17,18} },
//        	    { {19,20,21}, {22,23,24}, {25,26,27} }
//        	};

    }
}
